app/controllers/employee/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def show
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1

  def create
    @employee = Employee.new(create_employee_params)
    if @employee.save
---
INSERT INTO "employees" ("account_number", "approved", "authentication_token", "cancelled_at", "confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "date_of_birth", "email", "encrypted_password", "failed_attempts", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "locked_at", "middle_name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "unconfirmed_email", "unlock_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28) RETURNING "id"

  def edit
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1

  def update
    @employee = Employee.find(params[:id])

    if @employee.update_attributes(update_employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1
UPDATE "employees" SET "username" = 'demopass', "encrypted_password" = '$2a$10$tQIK3Z8o8Ns60dPWzL6DVupiOnOlIm/4Rur24TyRuvhmWaBns172W', "updated_at" = '2013-03-05 00:11:23.866549' WHERE "employees"."id" = 2

  def destroy
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1