app/controllers/employee/pages_controller.rb

  def home
    @clients = Client.all
---
SELECT "clients".* FROM "clients"