app/controllers/employee/registrations_controller.rb

  def create
    @employee = Employee.new(create_employee_params)

    if @employee.save
---
INSERT INTO "employees" ("account_number", "approved", "authentication_token", "cancelled_at", "confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "date_of_birth", "email", "encrypted_password", "failed_attempts", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "locked_at", "middle_name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "unconfirmed_email", "unlock_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28) RETURNING "id"

  def update
    @employee = current_employee
    prev_unconfirmed_email = @employee.unconfirmed_email if @employee.respond_to?(:unconfirmed_email)

    if @employee.update_with_password(update_employee_params)
---
UPDATE "employees" SET "first_name" = 'This', "last_name" = 'Rocks', "updated_at" = '2013-03-09 04:55:35.503057' WHERE "employees"."id" = 1