app/controllers/store/confirmations_controller.rb

SELECT "stores".* FROM "stores" WHERE "stores"."confirmation_token" = 'Weosqg9q6GtBRgWpuysx' LIMIT 1
---
  def show
    @store = Store.confirm_by_token(params[:confirmation_token])

    if @store.errors.empty?