app/controllers/pages_controller.rb

SELECT "customers".* FROM "customers"
---
  def home
    @customers = Customer.all