app/views/customer/pages/home.html.slim

    h3 Payment Profiles
    - current_customer.payment_profiles.each do |payment_profile|
---
SELECT "payment_profiles".* FROM "payment_profiles" WHERE "payment_profiles"."customer_id" = 1